-- MySQL dump 10.13  Distrib 5.7.28, for Linux (x86_64)
--
-- Host: localhost    Database: train
-- ------------------------------------------------------
-- Server version	5.7.28-0ubuntu0.16.04.2-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `station_train`
--

DROP TABLE IF EXISTS `station_train`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `station_train` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `start` varchar(45) COLLATE utf8_bin NOT NULL,
  `end` varchar(45) COLLATE utf8_bin NOT NULL,
  `train` varchar(45) COLLATE utf8_bin NOT NULL,
  PRIMARY KEY (`id`),
  KEY `index2` (`start`,`end`)
) ENGINE=InnoDB AUTO_INCREMENT=276 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `station_train`
--

LOCK TABLES `station_train` WRITE;
/*!40000 ALTER TABLE `station_train` DISABLE KEYS */;
INSERT INTO `station_train` VALUES (1,'杭州','海宁','Z282'),(2,'杭州','嘉兴','Z282'),(3,'杭州','上海南','Z282'),(4,'杭州','苏州','Z282'),(5,'杭州','无锡','Z282'),(6,'杭州','常州','Z282'),(7,'杭州','镇江','Z282'),(8,'杭州','南京','Z282'),(9,'杭州','蚌埠','Z282'),(10,'杭州','徐州','Z282'),(11,'杭州','兖州','Z282'),(12,'杭州','德州','Z282'),(13,'杭州','天津西北京','Z282'),(14,'杭州','张家口南','Z282'),(15,'杭州','大同','Z282'),(16,'杭州','集宁南','Z282'),(17,'杭州','呼和浩特东','Z282'),(18,'杭州','呼和浩特','Z282'),(19,'杭州','包头东','Z282'),(20,'杭州','包头','Z282'),(21,'海宁','嘉兴','Z282'),(22,'海宁','上海南','Z282'),(23,'海宁','苏州','Z282'),(24,'海宁','无锡','Z282'),(25,'海宁','常州','Z282'),(26,'海宁','镇江','Z282'),(27,'海宁','南京','Z282'),(28,'海宁','蚌埠','Z282'),(29,'海宁','徐州','Z282'),(30,'海宁','兖州','Z282'),(31,'海宁','德州','Z282'),(32,'海宁','天津西北京','Z282'),(33,'海宁','张家口南','Z282'),(34,'海宁','大同','Z282'),(35,'海宁','集宁南','Z282'),(36,'海宁','呼和浩特东','Z282'),(37,'海宁','呼和浩特','Z282'),(38,'海宁','包头东','Z282'),(39,'海宁','包头','Z282'),(40,'嘉兴','上海南','Z282'),(41,'嘉兴','苏州','Z282'),(42,'嘉兴','无锡','Z282'),(43,'嘉兴','常州','Z282'),(44,'嘉兴','镇江','Z282'),(45,'嘉兴','南京','Z282'),(46,'嘉兴','蚌埠','Z282'),(47,'嘉兴','徐州','Z282'),(48,'嘉兴','兖州','Z282'),(49,'嘉兴','德州','Z282'),(50,'嘉兴','天津西北京','Z282'),(51,'嘉兴','张家口南','Z282'),(52,'嘉兴','大同','Z282'),(53,'嘉兴','集宁南','Z282'),(54,'嘉兴','呼和浩特东','Z282'),(55,'嘉兴','呼和浩特','Z282'),(56,'嘉兴','包头东','Z282'),(57,'嘉兴','包头','Z282'),(58,'上海南','苏州','Z282'),(59,'上海南','无锡','Z282'),(60,'上海南','常州','Z282'),(61,'上海南','镇江','Z282'),(62,'上海南','南京','Z282'),(63,'上海南','蚌埠','Z282'),(64,'上海南','徐州','Z282'),(65,'上海南','兖州','Z282'),(66,'上海南','德州','Z282'),(67,'上海南','天津西北京','Z282'),(68,'上海南','张家口南','Z282'),(69,'上海南','大同','Z282'),(70,'上海南','集宁南','Z282'),(71,'上海南','呼和浩特东','Z282'),(72,'上海南','呼和浩特','Z282'),(73,'上海南','包头东','Z282'),(74,'上海南','包头','Z282'),(75,'苏州','无锡','Z282'),(76,'苏州','常州','Z282'),(77,'苏州','镇江','Z282'),(78,'苏州','南京','Z282'),(79,'苏州','蚌埠','Z282'),(80,'苏州','徐州','Z282'),(81,'苏州','兖州','Z282'),(82,'苏州','德州','Z282'),(83,'苏州','天津西北京','Z282'),(84,'苏州','张家口南','Z282'),(85,'苏州','大同','Z282'),(86,'苏州','集宁南','Z282'),(87,'苏州','呼和浩特东','Z282'),(88,'苏州','呼和浩特','Z282'),(89,'苏州','包头东','Z282'),(90,'苏州','包头','Z282'),(91,'无锡','常州','Z282'),(92,'无锡','镇江','Z282'),(93,'无锡','南京','Z282'),(94,'无锡','蚌埠','Z282'),(95,'无锡','徐州','Z282'),(96,'无锡','兖州','Z282'),(97,'无锡','德州','Z282'),(98,'无锡','天津西北京','Z282'),(99,'无锡','张家口南','Z282'),(100,'无锡','大同','Z282'),(101,'无锡','集宁南','Z282'),(102,'无锡','呼和浩特东','Z282'),(103,'无锡','呼和浩特','Z282'),(104,'无锡','包头东','Z282'),(105,'无锡','包头','Z282'),(106,'常州','镇江','Z282'),(107,'常州','南京','Z282'),(108,'常州','蚌埠','Z282'),(109,'常州','徐州','Z282'),(110,'常州','兖州','Z282'),(111,'常州','德州','Z282'),(112,'常州','天津西北京','Z282'),(113,'常州','张家口南','Z282'),(114,'常州','大同','Z282'),(115,'常州','集宁南','Z282'),(116,'常州','呼和浩特东','Z282'),(117,'常州','呼和浩特','Z282'),(118,'常州','包头东','Z282'),(119,'常州','包头','Z282'),(120,'镇江','南京','Z282'),(121,'镇江','蚌埠','Z282'),(122,'镇江','徐州','Z282'),(123,'镇江','兖州','Z282'),(124,'镇江','德州','Z282'),(125,'镇江','天津西北京','Z282'),(126,'镇江','张家口南','Z282'),(127,'镇江','大同','Z282'),(128,'镇江','集宁南','Z282'),(129,'镇江','呼和浩特东','Z282'),(130,'镇江','呼和浩特','Z282'),(131,'镇江','包头东','Z282'),(132,'镇江','包头','Z282'),(133,'南京','蚌埠','Z282'),(134,'南京','徐州','Z282'),(135,'南京','兖州','Z282'),(136,'南京','德州','Z282'),(137,'南京','天津西北京','Z282'),(138,'南京','张家口南','Z282'),(139,'南京','大同','Z282'),(140,'南京','集宁南','Z282'),(141,'南京','呼和浩特东','Z282'),(142,'南京','呼和浩特','Z282'),(143,'南京','包头东','Z282'),(144,'南京','包头','Z282'),(145,'蚌埠','徐州','Z282'),(146,'蚌埠','兖州','Z282'),(147,'蚌埠','德州','Z282'),(148,'蚌埠','天津西北京','Z282'),(149,'蚌埠','张家口南','Z282'),(150,'蚌埠','大同','Z282'),(151,'蚌埠','集宁南','Z282'),(152,'蚌埠','呼和浩特东','Z282'),(153,'蚌埠','呼和浩特','Z282'),(154,'蚌埠','包头东','Z282'),(155,'蚌埠','包头','Z282'),(156,'徐州','兖州','Z282'),(157,'徐州','德州','Z282'),(158,'徐州','天津西北京','Z282'),(159,'徐州','张家口南','Z282'),(160,'徐州','大同','Z282'),(161,'徐州','集宁南','Z282'),(162,'徐州','呼和浩特东','Z282'),(163,'徐州','呼和浩特','Z282'),(164,'徐州','包头东','Z282'),(165,'徐州','包头','Z282'),(166,'兖州','德州','Z282'),(167,'兖州','天津西北京','Z282'),(168,'兖州','张家口南','Z282'),(169,'兖州','大同','Z282'),(170,'兖州','集宁南','Z282'),(171,'兖州','呼和浩特东','Z282'),(172,'兖州','呼和浩特','Z282'),(173,'兖州','包头东','Z282'),(174,'兖州','包头','Z282'),(175,'德州','天津西北京','Z282'),(176,'德州','张家口南','Z282'),(177,'德州','大同','Z282'),(178,'德州','集宁南','Z282'),(179,'德州','呼和浩特东','Z282'),(180,'德州','呼和浩特','Z282'),(181,'德州','包头东','Z282'),(182,'德州','包头','Z282'),(183,'天津西北京','张家口南','Z282'),(184,'天津西北京','大同','Z282'),(185,'天津西北京','集宁南','Z282'),(186,'天津西北京','呼和浩特东','Z282'),(187,'天津西北京','呼和浩特','Z282'),(188,'天津西北京','包头东','Z282'),(189,'天津西北京','包头','Z282'),(190,'张家口南','大同','Z282'),(191,'张家口南','集宁南','Z282'),(192,'张家口南','呼和浩特东','Z282'),(193,'张家口南','呼和浩特','Z282'),(194,'张家口南','包头东','Z282'),(195,'张家口南','包头','Z282'),(196,'大同','集宁南','Z282'),(197,'大同','呼和浩特东','Z282'),(198,'大同','呼和浩特','Z282'),(199,'大同','包头东','Z282'),(200,'大同','包头','Z282'),(201,'集宁南','呼和浩特东','Z282'),(202,'集宁南','呼和浩特','Z282'),(203,'集宁南','包头东','Z282'),(204,'集宁南','包头','Z282'),(205,'呼和浩特东','呼和浩特','Z282'),(206,'呼和浩特东','包头东','Z282'),(207,'呼和浩特东','包头','Z282'),(208,'呼和浩特','包头东','Z282'),(209,'呼和浩特','包头','Z282'),(210,'包头东','包头','Z282'),(211,'上海虹桥','无锡东','G102'),(212,'上海虹桥','常州北','G102'),(213,'上海虹桥','南京南','G102'),(214,'上海虹桥','滁州','G102'),(215,'上海虹桥','蚌埠南','G102'),(216,'上海虹桥','宿州东','G102'),(217,'上海虹桥','徐州东','G102'),(218,'上海虹桥','济南西','G102'),(219,'上海虹桥','廊坊','G102'),(220,'上海虹桥','北京南','G102'),(221,'无锡东','常州北','G102'),(222,'无锡东','南京南','G102'),(223,'无锡东','滁州','G102'),(224,'无锡东','蚌埠南','G102'),(225,'无锡东','宿州东','G102'),(226,'无锡东','徐州东','G102'),(227,'无锡东','济南西','G102'),(228,'无锡东','廊坊','G102'),(229,'无锡东','北京南','G102'),(230,'常州北','南京南','G102'),(231,'常州北','滁州','G102'),(232,'常州北','蚌埠南','G102'),(233,'常州北','宿州东','G102'),(234,'常州北','徐州东','G102'),(235,'常州北','济南西','G102'),(236,'常州北','廊坊','G102'),(237,'常州北','北京南','G102'),(238,'南京南','滁州','G102'),(239,'南京南','蚌埠南','G102'),(240,'南京南','宿州东','G102'),(241,'南京南','徐州东','G102'),(242,'南京南','济南西','G102'),(243,'南京南','廊坊','G102'),(244,'南京南','北京南','G102'),(245,'滁州','蚌埠南','G102'),(246,'滁州','宿州东','G102'),(247,'滁州','徐州东','G102'),(248,'滁州','济南西','G102'),(249,'滁州','廊坊','G102'),(250,'滁州','北京南','G102'),(251,'蚌埠南','宿州东','G102'),(252,'蚌埠南','徐州东','G102'),(253,'蚌埠南','济南西','G102'),(254,'蚌埠南','廊坊','G102'),(255,'蚌埠南','北京南','G102'),(256,'宿州东','徐州东','G102'),(257,'宿州东','济南西','G102'),(258,'宿州东','廊坊','G102'),(259,'宿州东','北京南','G102'),(260,'徐州东','济南西','G102'),(261,'徐州东','廊坊','G102'),(262,'徐州东','北京南','G102'),(263,'济南西','廊坊','G102'),(264,'济南西','北京南','G102'),(265,'廊坊','北京南','G102'),(266,'上海','苏州北','G6'),(267,'上海','南京南','G6'),(268,'上海','济南西','G6'),(269,'上海','北京南','G6'),(270,'苏州北','南京南','G6'),(271,'苏州北','济南西','G6'),(272,'苏州北','北京南','G6'),(273,'南京南','济南西','G6'),(274,'南京南','北京南','G6'),(275,'济南西','北京南','G6');
/*!40000 ALTER TABLE `station_train` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-12-17  1:29:28
